{
  "backend/main.mo": "Motoko backend providing user profile management with authorization, contact form submission storage, admin-only retrieval, and a public location query.",
  "feature_evidence.json": "Feature evidence report linking a hero overlay opacity update to the specific frontend file and related components.",
  "frontend-file-summaries.txt": "Prewritten summaries detailing the purpose of each frontend file in the marketing site.",
  "frontend/index.css": "Tailwind base styles defining OKLCH theme variables, light/dark modes, and global component styling.",
  "frontend/index.html": "HTML entry file with SEO metadata and Google Fonts preconnect for the React app.",
  "frontend/src/App.tsx": "Main app component composing all marketing sections with header and footer.",
  "frontend/src/features/contact/hooks/useSubmitContactForm.ts": "Empty placeholder file for a contact form submission hook.",
  "frontend/src/features/marketing/components/BrandMark.tsx": "Renders the Farm 2 Kitchen logo with configurable sizing.",
  "frontend/src/features/marketing/components/SiteFooter.tsx": "Footer showing copyright, attribution, and a caffeine.ai referral link.",
  "frontend/src/features/marketing/components/SiteHeader.tsx": "Sticky responsive header with logo, navigation links, and mobile menu behavior.",
  "frontend/src/features/marketing/config/whatsapp.ts": "Exports WhatsApp config containing the numeric chat destination.",
  "frontend/src/features/marketing/sections/AboutSection.tsx": "About section describing sourcing, processing, and delivery with three feature cards.",
  "frontend/src/features/marketing/sections/ContactSection.tsx": "Contact section displaying location, phone number, and a WhatsApp chat button without form submission.",
  "frontend/src/features/marketing/sections/HeroSection.tsx": "Landing hero with background image, tagline, and buttons that scroll to About or Contact sections.",
  "frontend/src/features/marketing/sections/QualityPromiseSection.tsx": "Shows an image and a four-step quality process with icons describing cleaning, drying, grinding, and packing.",
  "frontend/src/features/marketing/sections/TestimonialsSection.tsx": "Displays three customer testimonials with quotes, names, and locations.",
  "frontend/src/features/marketing/sections/UsesSection.tsx": "Lists four common uses of the turmeric product with icons and descriptions, alongside a decorative background image.",
  "frontend/src/features/marketing/sections/WhyChooseSection.tsx": "Highlights five selling points of the product using icons and brief benefit descriptions.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, reinitializing when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching contact submissions and location info from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color palette themed around turmeric with light/dark modes and utilities.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, wrapping it in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters (including hash-based routes), storing them in sessionStorage, retrieving them, and clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining color tokens, typography, animations, container settings, and custom plugins.",
  "project_state.json": "Project metadata describing the Farm 2 Kitchen website state, design goals, contact/hero requirements, known issues, and implemented feature records."
}